In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
#从map开始创建
data = {
    'Country':['China','India','Brazil'],
    'Captial':['Beijing','New Delhi','Brasiliza'],
    'population':['1238374913','12348742','2349872398745'],
}

In [10]:
df = DataFrame(data)
df

  Country    Captial     population
0   China    Beijing     1238374913
1   India  New Delhi       12348742
2  Brazil  Brasiliza  2349872398745

In [11]:
#更换index的值
df = DataFrame(data,index=['A','B','C'])
df

  Country    Captial     population
A   China    Beijing     1238374913
B   India  New Delhi       12348742
C  Brazil  Brasiliza  2349872398745

In [15]:
# df.loc[0:2,1:2]
#df
#loc的用法改变了，不能这么用了

In [16]:
df.iloc[0:2,1:2]

     Captial
A    Beijing
B  New Delhi

In [18]:
#有点和遍历相像
for row in df.iterrows():
    print(row[0],row[1])
    break

A Country            China
Captial          Beijing
population    1238374913
Name: A, dtype: object

In [19]:
#dataframe返回的值都是Serires

In [25]:
data

{'Country': ['China', 'India', 'Brazil'],
 'Captial': ['Beijing', 'New Delhi', 'Brasiliza'],
 'population': ['1238374913', '12348742', '2349872398745']}

In [24]:
s1 = Series(data['Captial'])
s2 = Series(data['Country'])
s3 = Series(data['population'])
df_new = DataFrame([s1,s2,s3],index=['Captial','Country','Population'])
df_new.T #T代表矩阵反转

     Captial Country     Population
0    Beijing   China     1238374913
1  New Delhi   India       12348742
2  Brasiliza  Brazil  2349872398745

In [26]:
df_new.index

Index(['Captial', 'Country', 'Population'], dtype='object')

In [36]:
#更改Index的值
df_new.index = ['A','B','C']
df_new

            0          1              2
A     Beijing  New Delhi      Brasiliza
B       China      India         Brazil
C  1238374913   12348742  2349872398745

In [33]:
df

  Country    Captial     population
A   China    Beijing     1238374913
B   India  New Delhi       12348742
C  Brazil  Brasiliza  2349872398745